app/controllers/forms_controller.rb

  def index
    @forms = Form.all
---
SELECT "forms".* FROM "forms"