app/controllers/response_types_controller.rb

SELECT "response_types".* FROM "response_types"
---
  def index
    @response_types = ResponseType.all