app/controllers/user_responses_controller.rb

SELECT  "user_responses".* FROM "user_responses" WHERE "user_responses"."user_id" = ? ORDER BY "user_responses"."id" DESC LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "user_responses".* FROM "user_responses" WHERE "user_responses"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def brand_new
    @user_response ||= current_user.user_responses.last
    if !@user_response.nil?
      @question = Question.find(@user_response.question.id)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" ORDER BY "questions"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def new
    @user_response = UserResponse.new
    puts "hereeeeeeeee "
    if params[:question_id].present?
      @question = Question.find(params[:question_id])
        # render :partial => 'user_responses/form', locals: {user_response: @user_response}
    else
      @question = Question.first

INSERT INTO "user_responses" ("response", "user_id", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["response", "Claridge\n"], ["user_id", 1], ["question_id", 1], ["created_at", "2017-07-23 15:24:42.171366"], ["updated_at", "2017-07-23 15:24:42.171366"]]
---
  def create
    @user_response = current_user.user_responses.new(user_response_params)
    # @user_response.user_id = params[:user_id]
    # @user_response.question_id = params[:question_id]

    # @question = # you need to find the question base on the question_id
    # base on the question postions going be getting the next question

    respond_to do |format|
      format.json {
        render json: {
          is_success: @user_response.save,
          url: new_user_response_path(:question_id => @user_response.question_id.to_i + 1)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
          redirect_to root_path, notice: "You're done!" # application is done!
        else
          # if params[:question_id].present?
            @question = Question.find(@user_response.next_question.id.to_i)

UPDATE "user_responses" SET "response" = ?, "updated_at" = ? WHERE "user_responses"."id" = ?  [["response", "miami"], ["updated_at", "2017-07-24 21:20:53.402373"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @user_response.update(user_response_params)

DELETE FROM "user_responses" WHERE "user_responses"."id" = ?  [["id", 18]]
---
  def destroy
    @user_response.destroy

SELECT  "user_responses".* FROM "user_responses" WHERE "user_responses"."user_id" = ? ORDER BY "user_responses"."id" DESC LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
---
    def set_user_response
      @user_response = UserResponse.find(params[:id])